#=Задача 3. Определить тип, позволяющий итерировать все k-элементные подмножества заданного n-элементного множества.
Указание. Обеспечить возможность передавать в конструктор типа как только число n, что соответствовало бы последовательности 
{1,2,...,n}, так и непосредственно какую-либо другую последовательность, представленную одномерным массивом.=#
function (k,s)
    Set=collect(k)
    for x in new_array
        for i in range(len(Set))
            if k == i
                tmp = deepcopy(Set[i])
                tmp.insert(x) # вставка элемента
                Set.insert!(tmp_list)
            end
        end
    end
    print(Set)
end

